# Day 5 : Pandas

In [3]:
import pandas as pd
import numpy as np

# Working with series

In [7]:
list1 = [1,2,3,4,5]
sr1=pd.Series(list1)
print(sr1)
print(type(sr1))
list2 = [1,2,3,4,5]
sr2=pd.Series(list2,index=["A","B","C","D","E"])
print(sr2)
print(type(sr2))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
A    1
B    2
C    3
D    4
E    5
dtype: int64
<class 'pandas.core.series.Series'>

### Make a series of students name along with roll number as  index

In [16]:
studentName=["Students","Prajwal","Priyanka","Anshu DimpleKing","Asmita DimpleQueen","Sudip","Ankita"]
seriess=pd.Series(studentName,index=["Roll Number",1,2,3,4,5,6])
print(seriess)

Roll Number              Students
1                         Prajwal
2                        Priyanka
3                Anshu DimpleKing
4              Asmita DimpleQueen
5                           Sudip
6                          Ankita
dtype: object

### Generate Series using Numpy and Pandas

In [28]:
# Generate Series using Numpy and Pandas
series1=pd.Series(np.arange(5))          # Using arange
print(series1)
print()
series2=pd.Series(np.random.rand(5))     # Using random
print(series2)

0    0
1    1
2    2
3    3
4    4
dtype: int64

0    0.245921
1    0.667900
2    0.841454
3    0.494671
4    0.300745
dtype: float64

### ADD TWO SERIES

In [33]:
series1=pd.Series(np.arange(5,10))
series2=pd.Series(np.arange(10,15))
print(series1+series2)

0    15
1    17
2    19
3    21
4    23
dtype: int64

In [34]:
print(series1*series2)

0     50
1     66
2     84
3    104
4    126
dtype: int64

# DataFrame   (2D array vako ma use hunxa)

### Dictionary to DataFrame Conversion

In [38]:
# pd.DataFrame()
dic1={"A":[1,2,3,4,5],"B":[9,8,7,6,5]}
print(dic1)
df=pd.DataFrame(dic1)
print(df)

{'A': [1, 2, 3, 4, 5], 'B': [9, 8, 7, 6, 5]}
   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [40]:
df

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [70]:
student = ["STD1","STD2","STD3","STD4","STD5"]
rollno = ["001","002","003","004","005"]
marks = [25,55,68,78,100]
dic2={"Students":student, "Roll No":rollno,"Marks Obtained":marks}
dfStd=pd.DataFrame(dic2)
dfStd

  Students Roll No  Marks Obtained
0     STD1     001              25
1     STD2     002              55
2     STD3     003              68
3     STD4     004              78
4     STD5     005             100

In [72]:
dfStd[["Roll No","Marks Obtained"]]    # Multiple Row Access Garna lai Array ko dimension consider garne

  Roll No  Marks Obtained
0     001              25
1     002              55
2     003              68
3     004              78
4     005             100

In [80]:
student = ["STD1","STD2","STD3","STD4","STD5"]
rollno = ["001","002","003","004","005"]
marks = [25,55,68,78,100]
dic2={"Students":student, "Roll No":rollno,"Marks Obtained":marks}
dfStd=pd.DataFrame(dic2)
dfStd.set_index("Roll No")

        Students  Marks Obtained
Roll No
001         STD1              25
002         STD2              55
003         STD3              68
004         STD4              78
005         STD5             100

### 5 Student Name, Age, Location, College Name

In [82]:
stdName=["Prajwal","Priyanka","Sudip","Ankita","Anshu DimpleKing", "Asmita DimpleQueen"]
age=[20,21,22,23,24,25]
location=["Itahari","Duhabi","Khanar","Sudipko Ghar","Gadhi Gaupalika","Anshuko Ghar"]
college=["IIC","IIC","VAC","VAC","GPLC","GPLC"]
stdDic={"Student Name":stdName, "Age":age, "Address": location,"College":college}
DF=pd.DataFrame(stdDic)
DF

         Student Name  Age          Address College
0             Prajwal   20          Itahari     IIC
1            Priyanka   21           Duhabi     IIC
2               Sudip   22           Khanar     VAC
3              Ankita   23     Sudipko Ghar     VAC
4    Anshu DimpleKing   24  Gadhi Gaupalika    GPLC
5  Asmita DimpleQueen   25     Anshuko Ghar    GPLC

# Concatination

In [83]:
df3 = pd.DataFrame ({"A":[1,2,3,4,5], "B":[6,7,8,9,10], "C":[6,7,4,2,6]})
df3

   A   B  C
0  1   6  6
1  2   7  7
2  3   8  4
3  4   9  2
4  5  10  6

In [87]:
df3["Sum "]= df3["A"] + df3["B"] + df3["C"]
df3

   A   B  C   D  Sum  Sum of A B C D
0  1   6  6  13   13              13
1  2   7  7  16   16              16
2  3   8  4  15   15              15
3  4   9  2  15   15              15
4  5  10  6  21   21              21

In [89]:
df3["Average"] = (df3["A"] + df3["B"] + df3["C"])/3
df3

   A   B  C   D  Sum  Sum of A B C D   Average
0  1   6  6  13   13              13  4.333333
1  2   7  7  16   16              16  5.333333
2  3   8  4  15   15              15  5.000000
3  4   9  2  15   15              15  5.000000
4  5  10  6  21   21              21  7.000000

In [90]:
df3.shape

(5, 7)

### Export DataFrame To CSV

In [96]:
#  To csv 
df3.to_csv("abcd.csv")

### Import DataFrame From CSV

In [104]:
# read_csv(path)
df_read=pd.read_csv("abcd.csv")

In [105]:
df_read

   Unnamed: 0  A   B  C   D  Sum  Sum of A B C D   Average
0           0  1   6  6  13   13              13  4.333333
1           1  2   7  7  16   16              16  5.333333
2           2  3   8  4  15   15              15  5.000000
3           3  4   9  2  15   15              15  5.000000
4           4  5  10  6  21   21              21  7.000000

In [106]:
del df_read["Unnamed: 0"]

In [108]:
df_read

   A   B  C   D  Sum  Sum of A B C D   Average
0  1   6  6  13   13              13  4.333333
1  2   7  7  16   16              16  5.333333
2  3   8  4  15   15              15  5.000000
3  4   9  2  15   15              15  5.000000
4  5  10  6  21   21              21  7.000000